textRes.AntiAddiction = {
  [1] = "您目前在线时间已达3小时，请适当休息一下，合理安排一下游戏时间。",
  [2] = "您累计在线时间已达8小时，请适当休息一下，合理安排一下游戏时间。",
  [3] = "防沉迷提示",
  [4] = "知道了",
  [10] = "您在线时长过久，%s后将会强制休息，请提前做好准备避免游戏损失。",
  [11] = "您今日单次连续在线已达%d小时，请您休息%d分钟再回来吧！",
  [12] = "您今日单次连续在线已达%d小时，保护未成年人从我做起，请您休息%d分钟吧！",
  [13] = "您今日累积在线已达%d小时，请稍作休息%d分钟再回来！",
  [14] = "您今日累积在线已达%d小时，保护未成年人从我做起，请稍作休息%d分钟再回来",
  [15] = "您今日累积登陆已超%d小时，此后每小时都将请您休息%d分钟",
  [16] = "小时",
  [17] = "分钟",
  [18] = "秒",
  [19] = "您当前在线时长为%s，%s后将会强制休息，请提前做好准备避免游戏损失。",
  [20] = "您累计在线时长为%s，%s后将会强制休息，请提前做好准备避免游戏损失。"
}
