textRes.Awakening = {
  [1] = "击败全部剑灵后才能解开天机锁",
  [2] = "您学会了%s",
  [3] = "您今日斩龙六式帮打次数已达上限(%d次),继续战斗将不会获得奖励",
  [4] = "您已经学会了斩龙六式",
  [5] = "您已经学会了%s",
  ["SwordName"] = {
    [1] = "镇妖邪",
    [2] = "诛魔念",
    [3] = "破万法",
    [4] = "断阴阳",
    [5] = "灭苍穹",
    [6] = "斩鬼神"
  },
  ["EnterFightFail"] = {
    [1] = "您不能参与这个挑战",
    [2] = "您已经挑战通过了",
    [3] = "发放奖励失败",
    [4] = "队伍信息变化,不能发起挑战",
    [5] = "您不是队长,不能操作",
    [6] = "活动还未开启"
  },
  ["FinishFail"] = {
    [1] = "您不能参与这个挑战",
    [2] = "发放奖励失败",
    [3] = "完成全部战斗才能够解开天机锁"
  },
  [101] = "领取任务成功",
  [102] = "完成任务",
  [103] = "战斗胜利",
  [104] = "天机不可泄露",
  [105] = "您今天帮打次数已达上限(%d次),继续战斗将不会获得奖励",
  [106] = "您已经接取过亦正亦邪的任务了",
  [107] = "鬼王之力，融合！",
  [108] = "您还不能挑战邪恶的天云道人",
  ["TakeTaskFail"] = {
    [1] = "您不能领取这个任务",
    [2] = "活动状态错误",
    [3] = "物品不足",
    [4] = "发放奖励失败",
    [5] = "活动还未开启"
  },
  ["FightEvilFail"] = {
    [1] = "您不能参与这个挑战",
    [2] = "活动状态错误",
    [3] = "发放奖励失败",
    [4] = "队伍状态发生变化",
    [5] = "您不是队长,不能操作",
    [6] = "活动还未开启"
  },
  [301] = "您已经完成这个任务了",
  [302] = "领取任务成功",
  ["TaskFail"] = {
    [1] = "您不能领取这个任务",
    [2] = "接取任务失败",
    [3] = "领取奖励失败",
    [4] = "活动未开启"
  },
  [1001] = "觉醒之路开始，请开始挑战关卡吧~",
  [1002] = "你需要先解锁其他六峰的天机锁，才能进行觉醒哦",
  [1003] = "未觉醒",
  [1004] = "已觉醒",
  [1005] = "觉醒功能暂时关闭",
  [1006] = "您已经完成全部觉醒任务,正在前往道玄处开启觉醒~",
  [1007] = "你已经觉醒了",
  [1008] = "请先开启觉醒再进行此任务",
  [1009] = "请先开启觉醒",
  [1010] = "你没有飞剑,不能到达目的地",
  [1011] = "你不能使用这个道具",
  [1012] = "等级为%d级时才可以使用此道具",
  [1013] = "你已经完成%s了",
  [1014] = "所需道具数量不足",
  [1015] = "服务器等级大于%d级时才能使用此道具",
  [1016] = "%s功能关闭",
  ["FinishFail"] = {
    [1] = "您不能参加此活动",
    [2] = "您已经觉醒了!",
    [3] = "还有觉醒任务没有完成哦,不能开启觉醒"
  },
  ["ReportFail"] = {
    [1] = "您不能参加此活动",
    [2] = "您还没觉醒呢~"
  },
  ["ItemFeiShengFail"] = {
    [1] = "您不能参加这个活动",
    [2] = "你已经完成了这个活动",
    [3] = "你无需使用此物品",
    [4] = "物品不足"
  }
}
