textRes.BackToGame = {
  [1] = "%d年%d月%d日00:00:00",
  [2] = "最后1天",
  ["Sign"] = {
    [1] = "签到成功",
    ["Error"] = {
      [-1] = "您不是回归玩家哦~",
      [-2] = "您今天已经签到了~",
      [-3] = "签到天数不存在",
      [-4] = "发送奖励失败"
    }
  },
  ["Activity"] = {
    [1] = "领取成功",
    [2] = "积分达到%d才能领取哦~",
    ["Error"] = {
      [-1] = "您不是回归玩家哦~",
      [-2] = "奖励不存在",
      [-3] = "您已经领取过这个奖励了",
      [-4] = "积分不足哦",
      [-5] = "发送奖励失败",
      [-6] = "领取天数不对"
    }
  },
  ["Exp"] = {
    [1] = "领取成功",
    [2] = "参与",
    [3] = "已经领取过了",
    [4] = "还有%d天才能领取哦~",
    ["Error"] = {
      [-1] = "您不是回归玩家哦~",
      [-2] = "登录天数不足",
      [-3] = "奖励已经领取过了",
      [-4] = "奖励不存在",
      [-5] = "发送奖励失败"
    }
  },
  ["Task"] = {
    [1] = "领取任务成功",
    [2] = "领取任务(0/1)",
    [3] = "领取任务(1/1)",
    [4] = "已经完成过任务了哦~",
    [5] = "队长才能领取此任务哦~",
    [6] = "%d人以上组队才能领取此任务哦~",
    [7] = "你已经接取过这个任务了哦~",
    ["Error"] = {
      [-1] = "您不是回归玩家哦~",
      [-2] = "你不在队伍中",
      [-3] = "你不是队长",
      [-4] = "队伍人数不足",
      [-5] = "您已经领取过任务了",
      [-6] = "您已经完成任务了"
    }
  },
  ["BackHome"] = {
    [1] = "领取奖励成功",
    [2] = "已经领取过了",
    ["Error"] = {
      [-1] = "您不是回归玩家哦~",
      [-2] = "您已经领取过了",
      [-3] = "奖励不匹配",
      [-4] = "发送奖励失败"
    }
  },
  ["LimitSell"] = {
    [1] = "购买成功",
    [2] = "每日限购:%d/%d次",
    [3] = "%d折",
    [4] = "今天的购买次数已经用完了",
    [5] = "活动期间限购:%d/%d次",
    [6] = "购买次数已经用完了",
    [7] = "包裹已满,无法购买",
    ["Tab"] = {
      [1] = "一重礼",
      [2] = "二重礼",
      [3] = "三重礼",
      [4] = "四重礼",
      [5] = "五重礼"
    },
    ["Error"] = {
      [-1] = "您不是回归玩家哦~",
      [-2] = "没有这个商品",
      [-3] = "今天购买次数已经到达上限了",
      [-4] = "元宝不够了",
      [-5] = "充值额度不足",
      [-6] = "购买失败"
    }
  },
  ["Cat"] = {
    [1] = "您使用了<font color=#00ff00>%d</font>个<font color=#00ff00>%s</font>，获得<font color=#00ff00>%d</font>元宝",
    [2] = "<font color=#00ff00>%sx%d</font>",
    [3] = "您获得了%s",
    [4] = "<font color=#00ff00>%s</font>不足，不能兑换元宝",
    ["SUseManekiTokenError"] = {
      [-1] = "招财道具使用未知错误(%d)",
      [1] = "增加元宝失败"
    }
  }
}
