textRes.Banquet = {
  [1] = "诱人的美味佳肴即将出现，各位宾客请耐心等候。",
  [2] = "现在不在开办家宴的时间内，无法开启",
  [3] = "最后一波美食已经出现，请大家尽情享用",
  [4] = "家宴马上结束，宾客皆欢，请大家按顺序离场，欢迎下次再来做客",
  [5] = "您的等级不足,请提升等级后重试",
  [6] = "您的等级不足%d级",
  [7] = "您的家宴举办成功，请尽快在频道里邀请亲朋好友来赴宴吧，赴宴的人越多，宴会等级就越高哟",
  [8] = "当前处于家宴中，你是否要中途离开？",
  [9] = "您确认要开启家宴，宴请宾朋好友吗？如果开启，请尽快在频道里邀请亲朋好友来赴宴吧，赴宴的人越多，家园风水越高，宴会等级也随之提高，宴会等级越高，奖励越丰厚",
  ["banquetRank"] = {
    [1] = "普通宴会",
    [2] = "豪华宴会",
    [3] = "皇家宴会",
    [4] = "帝王盛宴"
  },
  ["retResult"] = {
    [1] = "今日家宴奖励领取次数已达上限",
    [2] = "每次家宴只能领取%s次奖励",
    [3] = "每波菜肴只能领取%s次奖励",
    [4] = "举办家宴次数已达上限",
    [5] = "只有家园创办者才能举办家宴",
    [6] = "正在举办家宴",
    [7] = "等级需要达到%s级才能参加",
    [8] = "%s需要等价达到%s才能参加",
    [9] = "当前家园内的人数已经达到%s人的上限"
  }
}
