textRes.BiYiLianZhi = {
  [1] = "只有夫妻组队才能接取",
  [2] = "您今日已完成过该活动。",
  [3] = "您的伴侣<font color=#00ff00>%s</font>今日已完成过该活动",
  [4] = "准备好接受“心有灵犀”的考验了吗？",
  [5] = "准备好了",
  [6] = "稍等片刻",
  [7] = "正在等待伴侣确认,剩余时间%02d秒",
  [8] = "您的伴侣<font color=#00ff00>%s</font>尚未准备完毕",
  [9] = "剩余答题时间",
  [10] = "等待伴侣答题",
  [11] = "准备好接受“烂漫回忆”的考验了吗？",
  [12] = "请耐心等待队长操作",
  [13] = "夫妻活动已重置，请重新接取，本环任务奖励照常发放",
  [14] = "队伍状态发生变化，当前已开启任务取消",
  [15] = "很遗憾，您和您的伴侣拼图未通关",
  [16] = "很遗憾，您和您的伴侣战斗未通关",
  [17] = "您的伴侣尚未准备好"
}
