textRes.CrossBattlefield = {
  [1] = "您已进入匹配状态，请耐心等候",
  [2] = "该战场只允许单人匹配",
  [3] = "匹配失败，请重新进行匹配",
  [4] = "%1$s VS %2$s",
  [5] = "由于上次您挂机或主动退出战场，这将导致您从现在起还有%s无法进行匹配",
  [6] = "%1$s ☆*%2$s",
  [7] = "积满[00ff00]%s[-]胜点额外升一颗星",
  [8] = "今日首次参加虚空战场，您获得了",
  ["Bounce"] = {
    [1] = "本场MVP",
    [2] = "连胜%1$s场"
  },
  ["CrossFieldErrorCode"] = {
    ["START_MATCH_UNKNOW_ERR"] = "开始匹配失败(%d)",
    ["CANCEL_MATCH_UNKNOW_ERR"] = "取消匹配失败(%d)",
    [-1] = "功能未开启或角色被禁止",
    [-2] = "角色状态错误",
    [-3] = "参数错误",
    [-4] = "NPC服务错误",
    [-5] = "数据库错误",
    [1] = "您不能参加该活动",
    [2] = "匹配失败，该战场只允许单人匹配",
    [3] = "已经加入匹配",
    [4] = "未知错误",
    [5] = "取消匹配失败，您不在匹配中",
    [6] = "正在取消匹配",
    [7] = "禁止参加匹配"
  },
  ["SSynCrossFieldMatchFail"] = {
    ["UNKNOW_ERR"] = "匹配失败(%d)",
    [0] = "匹配失败，未知错误",
    [1] = "匹配失败，获取token失败",
    [2] = "匹配失败，传输数据失败"
  },
  ["SSynCrossFieldWaitNextRoundMatch"] = {
    ["ERR_MSG"] = "等待下一轮匹配失败(%d)",
    ["COMMON_ERR"] = "当前匹配人数过多，正在努力排队中……",
    [1] = "匹配失败，无中心服"
  }
}
