textRes.DeliveryGame = {
  [1] = "传递%d次",
  [2] = "这个奖励还不能领取",
  [3] = "功能暂时关闭~",
  ["Mother"] = {
    [1] = "母亲节到来，系统已将%d朵康乃馨送给玩家：%s，传递康乃馨给好友即可获得奖励，全服传递数量到达%d次，更可领取母亲节大奖，大家踊跃参加吧",
    [2] = "%s送您一朵溢满祝福的康乃馨，是否继续传递？",
    [3] = "爱心传递",
    [4] = "传递",
    [5] = "%s送您一朵溢满祝福的康乃馨，您将这份祝福传递%s",
    [6] = "全服康乃馨传递次数已经到达%d次，是否立刻前往领取",
    [7] = "没有康乃馨可以传递",
    [8] = "您必须选择赠送的对象",
    [9] = "    每日0点，系统将发放一定数量康乃馨给随机在线玩家，将康乃馨传递给在线好友，即可获得奖励。\n    若120S内没有手动传递，系统会自动将康乃馨传递哦。\n    全服传递达到一定次数，所有玩家即可领取丰厚奖励。",
    [10] = "本服预计完成时间：[c76045]20:00:00[-]",
    [11] = "感恩传递将于[c76045]每日0点[-]结束，届时没有领取的奖励不可再领取哦。",
    [12] = "若120S内您没有传递康乃馨，系统将自动传递，但获得奖励较少哦",
    [13] = "梦幻诛仙",
    [14] = "了下去",
    [15] = "给了%s",
    [16] = "您没有康乃馨可以传递",
    [17] = "谁言寸草心，报得三春晖，祝天下所有伟大的母亲身体健康，节日快乐！",
    ["DeliveryFail"] = {
      [1] = "您没有康乃馨可以传递",
      [2] = "对方已经传递过康乃馨了",
      [3] = "对方已经下线"
    },
    ["FetchRewardFail"] = {
      [1] = "还不能领取这个阶段的奖励",
      [2] = "您已经领取过这个奖励了"
    }
  },
  ["Father"] = {
    [1] = "父亲节到来，系统已将%d朵向日葵送给玩家：%s，传递向日葵给好友即可获得奖励，全服传递数量到达%d次，更可领取父亲节大奖，大家踊跃参加吧",
    [2] = "%s送您一朵溢满祝福的向日葵，是否继续传递？",
    [3] = "爱心传递",
    [4] = "传递",
    [5] = "%s送您一朵溢满祝福的向日葵，您将这份祝福传递%s",
    [6] = "全服向日葵传递次数已经到达%d次，是否立刻前往领取",
    [7] = "没有向日葵可以传递",
    [8] = "您必须选择赠送的对象",
    [9] = "    每日0点，系统将发放一定数量向日葵给随机在线玩家，将向日葵传递给在线好友，即可获得奖励。\n    若120S内没有手动传递，系统会自动将向日葵传递哦。\n    全服传递达到一定次数，所有玩家即可领取丰厚奖励。",
    [10] = "本服预计完成时间：[c76045]20:00:00[-]",
    [11] = "爱的传递将于[c76045]每日0点[-]结束，届时没有领取的奖励不可再领取哦。",
    [12] = "若120S内您没有传递向日葵，系统将自动传递，但获得奖励较少哦",
    [13] = "梦幻诛仙",
    [14] = "了下去",
    [15] = "给了%s",
    [16] = "您没有向日葵可以传递",
    [17] = "父爱深沉，如山如海，祝天下所有伟大的父亲身体健康，节日快乐！",
    ["DeliveryFail"] = {
      [1] = "您没有向日葵可以传递",
      [2] = "对方已经传递过向日葵了",
      [3] = "对方已经下线"
    },
    ["FetchRewardFail"] = {
      [1] = "还不能领取这个阶段的奖励",
      [2] = "您已经领取过这个奖励了"
    }
  }
}
