textRes.FuBen = {
  [1] = "人",
  [2] = "本关剩余时间%02d分%02d秒",
  [3] = "剩余时间%02d分%02d秒",
  [4] = "服务器等级高于%d级才可进入此副本",
  [5] = "服务器等级低于%d级才可进入此副本",
  [6] = "此副本只能单人进入,请离开队伍后重试",
  [7] = "只有队长才能操作进入副本",
  [8] = "该副本只有%d~%d人组队时才可以进入",
  [9] = "该副本只有%d人组队时才可以进入",
  [10] = "队伍中有暂离或者离线成员,不能进入副本",
  [11] = "%s等级不满足条件,不能进入副本",
  [12] = "此副本需要男女两名角色组队进入",
  [13] = "此副本需要夫妻两名角色组队进入",
  [14] = "%s不是你的结义伙伴,不能进入此副本",
  [15] = "您没有帮派,不能进入此副本",
  [16] = "%s不是您的帮派成员,不能进入此副本",
  [17] = "您的帮打次数已经到达上限(%d次),继续参加不会获得奖励",
  [18] = "只有队长才能操作退出",
  [19] = "恭喜你已经通过,%d秒后,您将会被传送出副本",
  [20] = "您是否要花费%sx%d扫荡此副本?",
  [21] = "扫荡",
  [22] = "您是否要扫荡此副本?",
  [23] = "您已经完成此副本了,不能进行扫荡",
  [24] = "队长当前副本的进度为第%d关,你的进度为第%d关,是否确认进入副本?",
  [25] = "请等待其他队员同意",
  [26] = "您将以帮打玩家身份进入副本",
  ["ActivityFail"] = {
    [1] = "队伍状态发生变化,进入副本失败",
    [2] = "您不是队长,不能操作",
    [3] = "队伍中有暂离或者离线成员,不能进入副本",
    [4] = "你没有资格参加此活动",
    [5] = "您或者队伍成员不满足进入副本的等级",
    [6] = "您或者队伍成员已经完成过此活动了",
    [7] = "此副本未激活",
    [8] = "创建副本失败,请重试",
    [9] = "此副本已经完成",
    [10] = "您的进度不满足条件,不能扫荡此副本",
    [11] = "扫荡失败",
    [12] = "道具或者货币不足",
    [13] = "活动马上就结束了,不能进入此副本了",
    [14] = "活动限制条件不支持"
  },
  ["FuBenFail"] = {
    [1] = "您不在副本中",
    [2] = "您不是队长,不能操作退出"
  },
  ["MemberFail"] = {
    ["SelfName"] = "您",
    ["Unknow"] = "%s未满足条件（%d），无法进入副本",
    [1] = "<font color=#ffff00>%s</font>未设置宠物防御小队，无法进入副本"
  },
  ["ActivityAnnoucement"] = {
    ["DEFAULT"] = "恭喜[009fd6]%1$s[-]在[ffff00]%3$s[-]副本中获得%2$s",
    [constant.CPetArenaPVEActivityConsts.activity_cfg_id] = "恭喜[009fd6]%1$s[-]被自己的宠物从宠物军团的手里营救出来，从军团逃亡的一路捡到了%2$s"
  }
}
