textRes.InteractiveTask = {
  [1] = "您的%1$s请您%2$s，是否接受？",
  [2] = "您的%1$s不在线，暂时无法进行%2$s",
  [3] = "您的%1$s拒绝接受您的请求",
  [4] = "该任务已完成，请选择其余任务选项",
  [5] = "该任务正在进行中",
  [6] = "当前有其余任务在进行中，请稍后再试",
  [7] = "任务需要按顺序进行，请选择前一个未完成任务选项",
  [8] = "派发任务成功，请等待",
  [9] = "您是否要取消%1$s?",
  [10] = "倒计时：%1$s",
  [11] = "进行%1$s需要花费%2$s%3$s，是否确认？",
  [12] = "您的%1$s不足",
  [13] = "完成",
  ["SErrorInfo"] = {
    [1] = "您的%1$s不在线，暂时无法进行%2$s",
    [2] = "该任务正在进行中",
    [3] = "该任务已完成，请选择其余任务选项",
    [4] = "孩子已经流产，生产失败"
  }
}
