textRes.Present = {
  ["Error"] = {
    [730] = "物品赠送数量超过上限",
    [731] = "物品赠送元宝价值超过上限",
    [732] = "该玩家屏蔽了您"
  },
  [1] = "选中<font color=#ffff00>%s</font>",
  [2] = "没有更多物品了",
  [3] = "充值满%d元宝才能赠送商城物品！",
  [4] = "今日可赠送个数不足",
  [5] = "今日可赠送价值不足",
  [6] = "赠送成功",
  [7] = "请选择要赠送的礼物",
  [8] = "功能暂未开放",
  [9] = "太短了",
  [10] = "字数超过20字",
  [11] = "角色名含有非法字符",
  [12] = "这家伙很懒什么也没说",
  [13] = "对方与您还不是好友关系，赠送鲜花无法获得亲密度，确定要继续赠送吗？",
  [14] = "您已与对方达到鲜花赠送可获得亲密度的上限，赠送鲜花无法获得亲密度，确定要继续赠送吗？",
  [15] = "您赠送了<font color=#%s>%sx%d</font>给<font color=#00ff00>%s</font>",
  [16] = "您与%s间亲密度增加了%d",
  [17] = "<font color=#00ff00>%s</font>送给您<font color=#%s>%sx%d</font>, 留言:%s",
  [19] = "赠送给您[%s]%sx%d",
  [20] = "点击输入留言（20字）",
  [21] = "留言包含屏蔽字"
}
