textRes.QingYunZhi = {
  ["ErrorCode"] = {
    [1] = "通关前面挑战可解锁",
    [2] = "队员%1$s未解锁关卡，无法进入挑战",
    [3] = "不是队长，不能挑战",
    [4] = "组队不能参加普通章节"
  },
  ["Name"] = {
    [1] = "普通",
    [2] = "精英",
    [3] = "英雄"
  },
  [1] = "提示",
  [2] = "该关卡尚未解锁",
  [3] = "您确认要挑战该关卡吗？",
  [4] = "青云志发生未知错误 code=",
  [5] = "您的等级不满足条件，请%d级后再来挑战。",
  [6] = "精英青云志%1$d级开启",
  [7] = "英雄青云志%1$d级开启",
  [8] = "感谢你的热心，您今天的青云志【<font color=#ffff00>%s</font>】帮助次数剩余<font color=#ffff00>%d</font>次。",
  [9] = "您今天的青云志<font color=#ffff00>%s</font>帮助次数已经用完，无法获取热心奖励哦。"
}
