textRes.Soaring = {
  [1] = "达到%d才可参加飞升相关活动哦，赶紧去升级吧",
  [2] = "当前服务器等级不够",
  [3] = "确定要离开当前地图吗，退出后只能重新从第一回合开始。",
  ["GangChallenge"] = {
    [1] = "您已经完成了该挑战",
    [2] = "请选择一个挑战吧",
    [3] = "<font color=#00ff00>您已解除门派试练封印，不需要再次解除哦</font>",
    [4] = "强度较高，建议组队，助战可获得飞升福袋和侠义奖励！",
    [5] = "您今天已获得助战奖励%d次，再次助战不会获得奖励",
    [6] = "恭喜您完成了门派试练挑战，%s已解开此位的封印"
  },
  ["AncientSeal"] = {
    [1] = "需要购买道具：上古封印",
    [2] = "上古封印解除成功",
    [3] = "<font color=#00ff00>您已解除了上古封印,不需要再次解除哦</font>",
    [4] = "恭喜您完成了上古封印，%s已解开此位的封印",
    [5] = "%d/%d"
  },
  ["YaoHunXianJi"] = {
    [1] = "找任意星级妖兽战斗，捕捉<font color=#00ff00>变异冰兽</font>或<font color=#00ff00>变异死神</font>",
    [2] = "妖魂献祭封印解除成功",
    [3] = "<font color=#00ff00>您已成功解除妖魂献祭封印，不需要再次解除哦</font>",
    [4] = "恭喜您完成了妖魂献祭，%s已解开此位的封印"
  },
  ["ZhuXianJianZhen"] = {
    [1] = "已挑战过诛仙剑阵",
    [2] = "已经在队伍中，不能参加战斗",
    [3] = "所需物品不足o(╯□╰)o",
    [4] = "提交成功O(∩_∩)O",
    [5] = "诛仙剑阵 第一回合",
    [6] = "诛仙剑阵 第二回合",
    [7] = "活动%d秒后开始",
    [8] = "提交数量：%d/%d",
    [9] = "剩余时间：%d分%d秒",
    [10] = "击杀数量：%d/%d",
    [11] = "<font color=#00ff00>您已经成功解除诛仙剑阵封印，不需要再次解除封印哦</font>",
    [12] = "您今天已经挑战够多了，明天再来挑战吧",
    [13] = "恭喜您完成了诛仙剑阵，%s已解开此位的封印",
    [14] = "诛仙剑阵落下剑雨，辟法水晶挡住了剑阵攻击。",
    [15] = "诛仙剑阵落下剑雨，你被轰击出了法阵。",
    [16] = "诛仙剑阵光华乱绽，爆裂四起，恭喜你破阵成功！",
    [17] = "诛仙剑阵枢纽运转，万剑射来将你打翻在地。"
  },
  ["TianCaiDiBao"] = {
    [1] = "合成物品不足",
    [2] = "活动还未开始",
    [3] = "<font color=#00ff00>您已经成功解除天材地宝封印，不需要再次解除封印哦</font>",
    [4] = "恭喜您完成了天才地宝，%s已解开此位的封印"
  },
  ["QingYunAsk"] = {
    [1] = "<font color=#00ff00>您已经成功解除青云问道封印，不需要再次解除封印哦</font>",
    [2] = "您需要通关%s青云志第%d章第%d节",
    [3] = "恭喜您完成了青云问道，%s已解开此位的封印",
    ["QingYunName"] = {
      [1] = "普通",
      [2] = "精英",
      [3] = "英雄"
    },
    ["ErrorCode"] = {
      [1] = "玩家不能参加活动",
      [2] = "青云志未完成",
      [3] = "奖励失败"
    }
  },
  ["YZXG"] = {
    ["GET_ITEM_SUCCESS"] = "成功获取%s",
    ["MODULE_CLOSE_OR_ROLE_FORBIDDEN"] = "功能未开启或玩家被禁用",
    ["ROLE_STATUS_ERROR"] = "玩家状态错误",
    ["PARAM_ERROR"] = "参数错误",
    ["CHECK_NPC_SERVICE_ERROR"] = "检查NPC服务错误",
    ["CAN_NOT_JOIN_ACTIVITY"] = "玩家不能参加活动",
    ["ALREADY_GET_ITEM"] = "已经获取过物品",
    ["BAG_FULL"] = "包裹已满",
    ["EXTRA_VALUE_TO_LIMIT"] = "蓄灵球经验已达上限，将蓄灵球交予碧瑶",
    ["COST_FAIL_EXP"] = "您当前所拥有的经验值不够，无法度入蓄灵球",
    ["COST_FAIL"] = "扣除失败",
    ["COMMIT_ITEM_SUCCESS"] = "成功提交%s",
    ["COST_ITEM_FAIL"] = "扣除物品失败",
    ["EXTRA_VALUE_NOT_ENOUGH"] = "请先将经验灌注完毕",
    ["AWARD_FAIL"] = "奖励失败",
    ["DEVELOP_ITEM_SUCCESS"] = "您已成功度入%d点经验",
    [1] = "<font color=#00ff00>您已解除了运转玄功封印，不需要再次解除哦</font>",
    [2] = "恭喜您完成了运转玄功，%s已解开此位的封印"
  },
  ["WayOfCoatard"] = {
    [1] = "<font color=#00ff00>您已解除了破阵之器的封印，不需要再次解除哦</font>",
    [2] = "您已经接取过该任务了",
    [3] = "恭喜您完成了修真之途，%s已解开此位的封印"
  }
}
