textRes.WorldGoal = {
  ["CommitErrorCode"] = {
    [1] = "您现在暂时不能参加本活动",
    [2] = "您今天提交物品数量已达上限",
    [3] = "活动所需物品已满",
    [4] = "您当前没有可提交的物品",
    [5] = "提交物品奖励发放失败",
    [6] = "检查NPC服务失败",
    [7] = "活动当前地图任务已完成",
    [8] = "活动当前地图的任务暂未开启"
  },
  ["QureyErrorCode"] = {
    [1] = "活动尚未开启",
    [2] = "检查NPC服务失败"
  },
  [1] = "您在<font color=#00FF00>%s</font>活动中成功提交了<font color=#00FF00>%d</font>个<font color=#00FF00>%s</font>",
  [2] = "您的角色等级不足，请先将等级提升至%d级",
  [3] = "您的角色等级超出了可参加活动的最高等级--%d级",
  [4] = "您今天的提交数量已满<font color=#00FF00>%d</font>个, 请明天再来吧",
  [5] = "当前<font color=#00FF00>%s</font>活动在大家努力下，进度已达到<font color=#00FF00>%d/%d</font>。您今日还可以上交<font color=#00FF00>%d</font>个活动物品(<font color=#00FF00>%s</font>)。",
  [6] = "哇, 大家真给力, [00FF00]%s[-] 的鲜花已经完全绽放了(≧▽≦)，快去看看吧 ！",
  [7] = "哇, 大家真给力, <font color=#00FF00>%s</font> 的鲜花已经完全绽放了(≧▽≦)，快去看看吧！",
  [8] = "",
  [9] = "",
  [10] = "本功能尚未开启",
  ["SEnterWorldGoalActivityMapFail"] = {
    [1] = "您现在暂时不能参加本活动",
    [2] = "检查NPC服务失败",
    [3] = "没有配置传送地图ID"
  },
  ["SLeaveWorldGoalActivityMapFail"] = {
    [1] = "您现在不在活动地图中",
    [2] = "没有配置传送地图ID"
  }
}
