textRes.AnRanFuBen = {
  [1] = "第%s天",
  [2] = "未通关",
  [3] = "进入该副本需要双人组队，只有队长才可以操作",
  [4] = "%1$d分钟通关",
  [5] = "%1$d-%2$d分钟通关",
  [6] = "%1$d分钟以后",
  [7] = "退出确认",
  [8] = "退出副本后，副本进度将重置，同时你的队友会被传送出该副本。\n[ff0000]确定退出副本？[-]",
  [9] = "由于您的队友主动离开了副本，您将在%ds后自动退出副本",
  [10] = "未上榜",
  [11] = "活动暂未开放",
  [12] = "让我猜猜看，[ff8c00]<%=roleA_name%>[-]是[ff8c00]<%=roleB_name%>[-]的[ff8c00]<%=relationship_A_to_B%>[-]，是等级为[ff8c00]<%=roleA_level%>级[-]的[ff8c00]<%=roleA_occupation%>[-]弟子。",
  [13] = "组队时无法中途退出，请先离队再退出",
  [14] = "『辣手摧花』将直接完成当前关卡，但是作为惩罚会加时[ff0000]%s[-]，是否继续？",
  [15] = "加时惩罚<font color=#ff0000>%s</font>",
  [16] = "当前关卡已完成",
  [17] = "当前副本已结束",
  ["RIDDLE_SOLVER_TASK"] = "一阵恍惚过后，你听到前方传来了阵阵呼救声。虽然听上去很伤心，可这莫名的萌感是怎么回事……\n（您分配到的任务为“我要解谜”，[ff0000]帮助萌萌哒精灵解开桃花迷阵[-]，方能解锁第二关卡！）",
  ["ASSIST_TASK"] = "一阵眩晕过后，你发现自己被一群怪物环绕。戴上了黑框眼镜，发现它们似乎别有用处……\n（您分配到的任务为“我要杀怪”，[ff0000]快速击杀身边的怪物[-]，可以减少副本计时哟！）",
  ["NPC_QUESTION_BEGIN_TASK"] = "解决了小精灵的困难，顺便也消除了桃花劫，作为单身汪还真是开心呢……\n远处又是一阵喧闹，看来又有任务。我只是想拿点任务奖励，你们烦不烦？\n（跟随指引[ff0000]通过交谈找出所有说假话的守护者并击杀[-]，解锁第三关卡。）",
  ["COUPLE_CHALLENGE_BEGIN_TASK"] = "问帮派，问世界，问度娘，好不容易揪出几个熊孩子……\n是谁困住了萌萌哒小精灵？是谁往守卫者里扔进了几个间谍？一切都指向了ta！过了这关，总该拿奖励了吧？\n（跟随指引[ff0000]双人组队挑战神秘人[-]，通关副本。",
  ["SocialTypeName"] = {
    [0] = "丈夫",
    [1] = "妻子",
    [2] = "情缘",
    [3] = "好友"
  },
  ["OnSJoinAnRanFuBenFailed"] = {
    ["UNKNOW"] = "进入副本失败（%d）",
    [-1] = "活动未开启",
    [-2] = "进入该副本需要符合等级要求的双人组队",
    [-3] = "服务器忙，请稍后重试"
  },
  ["OnSSkipTaoHuaZhenFailed"] = {
    ["UNKNOW"] = "跳过关卡失败（%d）",
    [-1] = "活动未开启"
  },
  ["OnSStartCoupleChallengeFailed"] = {
    ["UNKNOW"] = "开启挑战失败（%d）",
    [-1] = "队伍状态不符合",
    [-2] = "队伍状态不符合",
    [-3] = "请先完成其他关卡",
    [-4] = "关卡已经挑战成功"
  },
  ["OnSGetQuestionFailed"] = {
    ["UNKNOW"] = "获取题目失败（%d）",
    [-1] = "活动未开启"
  },
  ["OnSStartQuestionFightFailed"] = {
    ["UNKNOW"] = "开启挑战失败（%d）",
    [-1] = "活动未开启"
  },
  ["OnSExitAnRanFuBenFailed"] = {
    ["UNKNOW"] = "退出副本失败（%d）",
    [-1] = "活动未开启",
    [-2] = "组队状态无法退出副本"
  }
}
