textRes.Cat = {
  [1] = "请给您的探险猫起一个新的名字吧",
  [2] = "您的探险猫正在探险，将于%02d时%02d分%02d秒后携宝归来",
  [3] = "%02d时%02d分%02d秒后可再次探险",
  [4] = "是否确认花费%d金币更换仙侣",
  [5] = "主人我出门啦！",
  [6] = "探险猫已经在少侠家中等候，请回家查看",
  [7] = "当前探险猫等级为%d，等级较高，无法出售！",
  [8] = "当前探险猫等级为%d，确认要出售吗？",
  [9] = "[00ff00]%s[-]投喂了您的探险猫。",
  [10] = "[00ff00]%s[-]投喂了这只探险猫。",
  [11] = "这只探险猫正在探险，将于%02d时%02d分%02d秒后携宝归来",
  [12] = "您的探险猫与[058711]%s[-]仙侣准备就绪，是否出发寻宝?",
  ["SQueryCatsFailed"] = {
    [-1] = "猫不存在"
  },
  ["SFeedCatFailed"] = {
    [-1] = "这只猫已经活力满满啦！",
    [-2] = "您已经投喂过这只猫了，无法继续投喂",
    [-3] = "每天投喂总次数达到上限",
    [-4] = "猫处于探险状态",
    [-5] = "这只猫正叼着宝箱，无法被投喂。"
  },
  ["SChangePartnerFailed"] = {
    [-1] = "金币不足"
  },
  ["SSendCatToExploreFailed"] = {
    [-1] = "探险猫活力未满，快叫好友来帮忙投喂把！",
    [-2] = "今日探险次数达到上限",
    [-3] = "这只探险猫正叼着宝箱，无法被投喂。"
  },
  ["SGetAwardFailed"] = {
    [-1] = "奖励不存在",
    [-2] = "包裹剩余空间不足"
  },
  ["SCatRecoveryToItemFailed"] = {
    [-1] = "这只探险猫正在探险,请祝它好运",
    [-2] = "这只探险猫正在休息,请祝它好梦",
    [-3] = "这只探险猫正叼着宝箱，无法被投喂。",
    [-4] = "包裹已满"
  },
  ["SCatRenameFailed"] = {
    [-1] = "名字非法",
    [-2] = "名称过短",
    [-3] = "名称过长"
  },
  ["SQueryFeedCatsFailed"] = {}
}
