textRes.Constellation = {
  [1] = "当前：%s",
  [2] = "更换：%s",
  [3] = "更换次数已用完，将在下次活动开启时刷新",
  [4] = "剩余次数：%s",
  [5] = "您还未选择任何星座",
  [6] = "[ff0000]%s[-]今日运势：%s",
  [7] = "本命星座：%s",
  [8] = "您已经预览了星牌",
  [9] = "现在不是您的本命星座，您无法提前知道每张牌的星级",
  [10] = "当前星座翻牌阶段已结束",
  [11] = "您已经选择了星牌",
  [12] = "十二星座回归星空，[ff0000]%d秒[-]后关闭界面，明天继续！",
  [13] = "更换本命星座成功",
  [14] = "选取一个本命星座可以获得这个星座的神秘祝福",
  [15] = "[00ffff]%s[-]还有[ff0000]%d分钟[-]开启，谁才是今天最幸运的星座？",
  [16] = "关闭界面将无法获得奖励，是否确定（可以在活动面板重新打开）",
  [17] = "正在加载本命星座信息，请稍后...",
  ["SConstellationNormalResult"] = {
    [1] = "已经抽过该轮的星牌，请下一轮再抽"
  }
}
