textRes.Fly = {
  [1] = "%s邀请与您同乘飞行，是否同意？",
  [2] = "同乘",
  [3] = "<font color=#00ff00>%s</font>拒绝了您的邀请",
  [4] = "已解除同乘",
  [5] = "邀请同乘",
  [6] = "您已经处理同乘中了",
  [7] = "组队状态下不可邀请同乘",
  [8] = "需要%d级才可以同乘飞剑",
  [9] = "需要飞剑才能同乘飞行",
  [10] = "变身状态下不可同乘",
  [11] = "拥有变身飞行器才能够邀请他(她)同乘飞剑哦~",
  ["CoupleFlyRes"] = {
    [0] = "邀请已发送",
    [1] = "该玩家暂时不能接受邀请",
    [2] = "该玩家正在与他人组队",
    [3] = "该玩家正在与他人同乘",
    [4] = "对方等级不足"
  },
  ["Error"] = {
    [0] = "对方没有飞行器",
    [1] = "对方暂时不能同乘飞行",
    [2] = "对方处于组队状，不能同乘",
    [3] = "对方已经和处于同乘状态",
    [4] = "邀请已过期"
  }
}
