textRes.KitchenGod = {
  [1] = "第一阶段",
  [2] = "打扫垃圾",
  [3] = "第二阶段",
  [4] = "收集贡品",
  [5] = "第三阶段",
  [6] = "祭祀灶神",
  [7] = "分配成功",
  [8] = "您已经祭祀过灶神啦",
  [9] = "技能尚在冷却中",
  [10] = "请等待当前技能效果结束哦",
  [11] = "退出活动",
  [12] = "您是否要退出活动？（退出活动后仍可以从活动面板再次从当前阶段参加本活动）",
  [13] = "成功清理%d处垃圾",
  [14] = "从小妖手中获得%d个贡品",
  [15] = "天眼开启中",
  [16] = "现形术使用中",
  [17] = "祭祀完成，您将在30秒之后被传出副本",
  [18] = "%d分%d秒",
  [19] = "%d秒",
  [20] = "请牢记小妖位置，技能结束后可使用现形术让小妖现形",
  [21] = "小妖已经现形啦，请技能结束后，找它夺回贡品",
  [22] = "咳咳，灰尘太大啦，打扫也需要一个个扫才行嘛",
  [23] = "哎呀，双拳难揍多妖，请一个个的揍哟",
  [24] = "请揍完小妖后再使用技能哦",
  [25] = "天眼术已开，快去四处查看暗处的小妖到底藏在哪儿",
  [26] = "哇塞，好炫的光，快去隐藏小妖的地方让它现形吧",
  ["SKitchenGodJoinFailedRep"] = {
    [1] = "活动尚未开启",
    [2] = "您不符合参加活动的要求",
    [3] = "请在非组队状态下来参加活动"
  },
  ["SKitchenGodCleanRespFailed"] = {
    [1] = "活动尚未开启",
    [2] = "您不符合参加活动的要求",
    [3] = "当前不是清扫垃圾阶段",
    [4] = "清扫垃圾的数量已经足够",
    [5] = "无效的垃圾",
    [6] = "垃圾逃跑啦"
  },
  ["SKitchenGodUseSkillRespFailed"] = {
    [1] = "活动尚未开启",
    [2] = "您不符合参加活动的要求",
    [3] = "当前不是收集祭品阶段",
    [4] = "使用的技能还在冷却中",
    [5] = "使用的技能无效",
    [6] = "请等待当前技能效果结束"
  },
  ["SKitchenGodMonsterRespFailed"] = {
    [1] = "活动尚未开启",
    [2] = "您不符合参加活动的要求",
    [3] = "当前不是收集祭品阶段",
    [4] = "收集祭品的数量已经足够",
    [5] = "无效的小妖",
    [6] = "不可见的小妖",
    [7] = "还在使用技能中哦",
    [8] = "小妖拿着祭品逃跑啦"
  },
  ["SKitchenGodWorshipRepsFailed"] = {
    [1] = "活动尚未开启",
    [2] = "您不符合参加活动的要求",
    [3] = "当前不是祭祀灶神阶段",
    [4] = "您已经祭祀过灶神啦"
  }
}
