textRes.RankList = {
  [1] = "榜外",
  [2] = "%s：",
  [3] = "三甲风采",
  [4] = "详细信息",
  [5] = "空缺",
  [6] = "%d小时%d分%d秒",
  [7] = "%d分%d秒",
  [8] = "%d秒",
  [9] = "无",
  [10] = "已删除",
  [11] = "当前无人上榜",
  [12] = "暂不开放跨服查询",
  [100] = "%d层",
  [101] = "%d分%02d秒",
  [102] = "未通关",
  [110] = "%02d秒",
  [111] = "%d分%02d秒",
  [112] = "未通过",
  ["BetRankColor"] = {
    [1] = "00ff00",
    [2] = "ff0000"
  },
  ["RankColor"] = {
    [1] = "fe7200",
    [2] = "ea01fd",
    [3] = "009fd6"
  },
  ["Title"] = {
    [0] = {
      "排名",
      "名称",
      "门派",
      "战力"
    },
    [1] = {
      "排名",
      "宠物名称",
      "主人姓名",
      "评分"
    },
    [2] = {
      "排名",
      "名称",
      "门派",
      "等级"
    },
    [3] = {
      "排名",
      "名称",
      "段位",
      "胜点"
    },
    [4] = {
      "排名",
      "名称",
      "称谓",
      "用时"
    },
    [5] = {
      "排名",
      "角色名",
      "门派",
      "护花积分"
    },
    [6] = {
      "排名",
      "角色名",
      "门派",
      "收花积分"
    },
    [7] = {
      "排名",
      "角色名",
      "门派",
      "积分"
    },
    [9] = {
      "排名",
      "角色名",
      "层数",
      "用时"
    },
    [10] = {
      "排名",
      "角色名",
      "门派",
      "用时"
    },
    [12] = {
      "排名",
      "角色名",
      "门派",
      "综合战力"
    },
    [13] = {
      "排名",
      "角色名",
      "门派",
      "收徒数量"
    },
    [14] = {
      "排名",
      "角色名",
      "门派",
      "积分"
    },
    [15] = {
      "排名",
      "角色名",
      "层数",
      "用时"
    },
    [16] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [17] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [18] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [19] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [20] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [21] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [22] = {
      "排名",
      "房屋主人",
      "房主配偶",
      "房屋评分"
    },
    [23] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [24] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [25] = {
      "排名",
      "角色名",
      "门派",
      "积分"
    },
    [26] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [27] = {
      "排名",
      "角色名",
      "门派",
      "积分"
    },
    [8] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [28] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [29] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [30] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [31] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [32] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [33] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [41] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [58] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [36] = {
      "排名",
      "子女名",
      "亲人名称",
      "子女评分"
    },
    [39] = {
      "排名",
      "角色名",
      "门派",
      "段位"
    },
    [40] = {
      "排名",
      "角色名",
      "门派",
      "段位"
    },
    [42] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [45] = {
      "排名",
      "名称",
      "门派",
      "本周人气值"
    },
    [50] = {
      "排名",
      "角色名",
      "获利（金币）"
    },
    [51] = {
      "排名",
      "角色名",
      "亏损（金币）"
    },
    [52] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [53] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [54] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [55] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [56] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [57] = {
      "排名",
      "角色",
      "门派",
      "积分",
      "段位"
    },
    [59] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    [60] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [61] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [62] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [63] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [64] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [65] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [66] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [67] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [68] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    [69] = {
      "排名",
      "名称",
      "挑战成功",
      "防守成功"
    },
    [70] = {
      "排名",
      "帮派名",
      "角色",
      "积分"
    },
    [71] = {
      "排名",
      "角色名",
      "轮数",
      "耗时"
    },
    [72] = {
      "排名",
      "帮派",
      "帮主",
      "积分",
      "胜场",
      "编号"
    },
    [73] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [74] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [75] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [76] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [77] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [78] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [79] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [80] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [81] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    },
    [83] = {
      "排名",
      "角色名",
      "门派",
      "收到的赞"
    },
    [88] = {
      "排名",
      "角色名",
      "关数",
      "用时"
    },
    [91] = {
      "排名",
      "角色名",
      "评价",
      "用时"
    },
    [92] = {
      "排名",
      "战队名称",
      "积分"
    },
    [93] = {
      "排名",
      "主人",
      "等级",
      "成长值"
    },
    [94] = {
      "排名",
      "战队名称",
      "积分"
    },
    [99] = {
      "排名",
      "角色名",
      "获利（金币）"
    },
    [100] = {
      "排名",
      "角色名",
      "亏损（金币）"
    },
    [101] = {
      "排名",
      "角色名",
      "花火积分",
      "花火数量"
    },
    [102] = {
      "排名",
      "角色名",
      "花火积分",
      "花火数量"
    },
    [103] = {
      "排名",
      "角色名",
      "帮派",
      "单次跑商最短时间"
    },
    [104] = {
      "排名",
      "角色名",
      "帮派",
      "单次上交本金"
    },
    [117] = {
      "排名",
      "帮派名",
      "积分",
      "胜场"
    },
    ["WORLD_BOSS"] = {
      "排名",
      "角色名",
      "门派",
      "伤害积分"
    },
    ["MULTI_FIGHT_VALUE"] = {
      "排名",
      "名称",
      "门派",
      "综合战力"
    },
    ["LEADER_BATTLE"] = {
      "排名",
      "角色名",
      "胜场",
      "积分"
    }
  },
  ["MyRankDataTypeName"] = {
    [0] = "我的战力",
    [1] = "我的宠物",
    [2] = "我的等级",
    [3] = "我的胜点",
    [4] = "我的用时",
    [5] = "护花积分",
    [6] = "收花积分",
    [7] = "我的积分",
    [9] = "我的用时",
    [10] = "我的用时",
    [12] = "我的综合战力",
    [13] = "弟子总数",
    [14] = "我的积分",
    [15] = "我的用时",
    [16] = "我的综合战力",
    [17] = "我的综合战力",
    [18] = "我的综合战力",
    [19] = "我的综合战力",
    [20] = "我的综合战力",
    [21] = "我的综合战力",
    [22] = "我的房屋评分",
    [23] = "我的积分",
    [24] = "我的积分",
    [25] = "我的积分",
    [26] = "我的综合战力",
    [27] = false,
    [8] = "我的积分",
    [28] = "我的积分",
    [29] = "我的积分",
    [30] = "我的积分",
    [31] = "我的积分",
    [32] = "我的积分",
    [33] = "我的积分",
    [41] = "我的积分",
    [58] = "我的积分",
    [36] = "我的子女评分",
    [39] = "我的段位",
    [40] = "我的段位",
    [42] = "我的综合战力",
    [45] = "我的人气值",
    [50] = "我的收益",
    [51] = "我的收益",
    [52] = "我的积分",
    [53] = "我的积分",
    [54] = "我的积分",
    [55] = "我的积分",
    [56] = "我的积分",
    [57] = "我的积分",
    [59] = "我的综合战力",
    [60] = "我的积分",
    [61] = "我的积分",
    [62] = "我的积分",
    [63] = "我的积分",
    [64] = "我的积分",
    [65] = "我的积分",
    [66] = "我的积分",
    [67] = "我的积分",
    [68] = "我的积分",
    [69] = "我的积分",
    [71] = "我的轮数/耗时",
    [72] = "本帮积分",
    [73] = "我的积分",
    [74] = "我的积分",
    [75] = "我的积分",
    [76] = "我的积分",
    [77] = "我的积分",
    [78] = "我的积分",
    [79] = "我的积分",
    [80] = "我的积分",
    [81] = "我的积分",
    [83] = "我收到的赞",
    [84] = "我的积分",
    [85] = "我的综合战力",
    [86] = "我的积分",
    [88] = "我的用时",
    [91] = "我的用时",
    [92] = "我的战队积分",
    [93] = "我的等级",
    [94] = "我的战队积分",
    [95] = "我的综合战力",
    [96] = "我的积分",
    [97] = "我的积分",
    [99] = "我的收益",
    [100] = "我的收益",
    [103] = "我的时间",
    [104] = "我上交的本金",
    [110] = "本帮积分",
    [111] = "本帮名次",
    [120] = "我的综合战力",
    [122] = "我的积分",
    [123] = "我的积分",
    ["WORLD_BOSS"] = "我的积分",
    ["MULTI_FIGHT_VALUE"] = "我的综合战力",
    ["LEADER_BATTLE"] = "我的积分",
    ["FLOWER_FIRE_GIVE"] = "我燃放的花火",
    ["FLOWER_FIRE_RECEIVE"] = "我收到的花火"
  },
  ["MyRankName"] = {
    [0] = "我的名次",
    [72] = "本帮名次",
    [92] = "我的战队排名",
    [94] = "我的战队排名",
    [117] = "本帮名次"
  },
  ["ExtraTitle"] = {
    [1] = "赛季时间：",
    [2] = "                赛季时间：",
    [3] = "赛季时间: "
  }
}
