textRes.TreasureHunt = {
  [1] = "退出后需重新挑战本关，是否确认退出？",
  [2] = "%d分%d秒",
  [3] = "%d/%d",
  [4] = "您打开了一个<font size=22 color=#00ff00>空礼盒</font>，搜寻时间<font size=22 color=#00ff00>减少%d秒</font>",
  [5] = "<font size=22 color=#00ff00>您成功找到礼物，恭喜通关！</font>",
  ["STreasureHuntNormalFail"] = {
    [1] = "活动配置不存在",
    [2] = "角色信息不存在",
    [3] = "活动没有参与资格",
    [4] = "仍在寻宝活动世界中",
    [5] = "寻宝活动已经通关了",
    [6] = "章节配置不存在",
    [7] = "当前章节配置不存在",
    [8] = "角色寻宝数据不存在",
    [9] = "SESSION不存在",
    [10] = "当前状态不能参与此活动",
    [11] = "设置状态失败",
    [12] = "<font size=22 color=#00ff00>搜寻时间已用完，很遗憾您未能通关</font>",
    [13] = "功能开关未开启",
    [14] = "今日参与次数已达上限，请明日再来",
    [15] = "NPC服务不可用",
    [16] = "对方寻宝中,不能参与组队",
    [17] = "寻宝中,不能参与组队"
  }
}
