textRes.TurnedCard = {
  [1] = "使用",
  [2] = "分解",
  [3] = "批量分解",
  [4] = "%d分",
  [5] = "%d场",
  [6] = "伤害",
  [7] = "您当前没有使用变身卡，是否确认使用%s变身卡？\n同品质同一张卡可叠加使用5次（累积次数和时间，属性不累加）",
  [8] = "您当前有变身效果，使用后将替换。是否确认使用%s变身卡？",
  [9] = "请选择一张变身卡",
  [10] = "当前变身卡需要消耗精气%d，不能变身",
  [11] = "当前变身卡需要达到%d级才能使用",
  [12] = "该变身卡的使用次数已达上限",
  [13] = "成功使用了%s变身卡, 百变精气 -%d",
  [14] = "请选择要分解的变身卡或道具",
  [15] = "分解成功，百变积分+%s",
  [16] = "是否确认分解该卡片？分解后获得%d百变积分，可用于抽取其他卡片",
  [17] = "<font size=22 color=#8f3d21>%d级变身卡【%s】</font><font size=22 color=#8f3d21>（增加%d经验）</font>",
  [18] = "您想要一次全部使用该物品？",
  [19] = "变身卡升级",
  [20] = "<font color=#%s>%s</font>经验 +%d",
  [21] = "积分不足",
  [22] = "伤害+%s",
  [23] = "伤害-%s",
  [24] = "不限",
  [25] = "当前已使用%s，继续使用将会叠加时间和PVP次数，是否确认？",
  [26] = "%s变身卡效果已消失",
  [27] = "使用成功",
  [28] = "封印",
  [29] = "抽卡",
  [30] = "无",
  [31] = "系别：%s",
  [32] = "请输入验证码，选择分解的变身卡有紫色以上品质的卡片,分解后将消失",
  [33] = "分解",
  [34] = "百变精气 +",
  [35] = "百变积分 +",
  [36] = "当前变身卡PVP次数仅剩%d次，请及时叠加使用",
  [37] = "当前变身卡剩余时间仅剩%d分钟，请及时叠加使用",
  [100] = "变身外观显示成功",
  [101] = "变身外观隐藏成功",
  [102] = "是否确认取消%s变身？",
  [103] = "变身卡效果已取消",
  [104] = "%s变身",
  [105] = "迷你",
  [106] = "显示",
  [107] = "系别：[bf3eff]%s[-]",
  [108] = "剩余时间：[b22222]%s[-]",
  [109] = "可PVP次数：[b22222]%s[-]",
  [110] = "[55965f]%s[-]",
  [111] = "[ff0000]%s[-]",
  ["levelColor"] = {
    [0] = "ffffff",
    [1] = "ffffff",
    [2] = "01b35b",
    [3] = "009fd6",
    [4] = "ea01fd",
    [5] = "fe7200",
    [6] = "ee0000"
  },
  ["CardsTuJian"] = {
    [1] = "全部卡片",
    [2] = "%s卡",
    [3] = "最高可达[%s]%s[-]"
  },
  ["CardClassName"] = {
    [0] = "全部",
    [1] = "散仙",
    [2] = "人形",
    [3] = "灵魄",
    [4] = "飞羽",
    [5] = "兽形",
    [6] = "巫毒"
  },
  ["CardLevelStr"] = {
    [1] = "白",
    [2] = "绿",
    [3] = "蓝",
    [4] = "紫",
    [5] = "橙",
    [6] = "彩"
  },
  ["colorName"] = {
    [1] = "白色",
    [2] = "绿色",
    [3] = "蓝色",
    [4] = "紫色",
    [5] = "橙色",
    [6] = "彩色"
  },
  ["UseCardFail"] = {
    [-1] = "角色等级不足",
    [-2] = "道具不存在",
    [-3] = "精气不足",
    [-4] = "堆叠次数已达上限"
  },
  ["CardDecomposeFail"] = {
    [-1] = "角色等级不足",
    [-2] = "变身卡不存在",
    [-3] = "增加积分失败，积分已达到最大值"
  },
  ["CardItemDecomposeFail"] = {
    [-1] = "角色等级不足",
    [-2] = "分解道具不存在",
    [-3] = "分解的道具不是变身卡道具或碎片",
    [-4] = "增加积分失败，积分已达到最大值",
    [-5] = "扣除道具失败"
  },
  ["CardUpgradeWithCardFail"] = {
    [-1] = "角色等级不足",
    [-2] = "升级变身卡不存在",
    [-3] = "变身卡已经满级",
    [-4] = "消耗变身卡不存在",
    [-5] = "消耗变身卡等级更高",
    [-6] = "消耗变身卡类型不同",
    [-7] = "消耗变身卡不可用于升级",
    [-8] = "消耗道具对应的变身卡等级更高"
  },
  ["CardLotteryDrawFail"] = {
    [-1] = "角色等级不足",
    [-2] = "抽奖类型不存在",
    [-3] = "积分不足",
    [-4] = "包裹已满",
    [-5] = "上次抽奖的奖励还未获得"
  },
  ["SetCardVisibleFail"] = {
    [-1] = "角色等级不足",
    [-2] = "变身卡未激活",
    [-3] = "变身卡已置为可见"
  },
  ["SetCardInvisibleFail"] = {
    [-1] = "角色等级不足",
    [-2] = "变身卡未激活",
    [-3] = "变身卡已置为不可见"
  },
  ["SCancelCardFail"] = {
    [-1] = "角色等级不足",
    [-2] = "变身卡未激活"
  }
}
