textRes.WorldBoss = {
  [1] = "购买成功",
  [2] = "剩余时间: ",
  [3] = "开放时间: ",
  [4] = "剩余次数: ",
  [5] = "不可挑战",
  [6] = "请到时间再来挑战",
  [7] = "榜外",
  [8] = "世界BOSS",
  [9] = "世界BOSS活动开始了，小伙伴们赶紧来参加吧！",
  [10] = "在战斗中无法参加",
  [11] = "在副本中无法参加",
  [12] = "伤害积分本服排行",
  [13] = "伤害积分跨服排行",
  ["ErrorCode"] = {
    [1] = "挑战次数不足，可点击购买增加挑战次数",
    [2] = "元宝不足",
    [3] = "您的等级不够，不能参加该活动",
    [4] = "组队状态下不能参加该活动",
    [5] = "活动尚未开启",
    [6] = "今日购买次数已经达到上限",
    [7] = "活动已经结束",
    [8] = "挑战次数没用完，不可购买"
  },
  ["CONFIRM_USE_NEW_OCCUP"] = "用新的职业挑战世界boss将清除之前职业的排名，是否确定？"
}
