textRes.CaptureTheFlag = {
  [1] = "对方处于战斗保护状态,暂时不能战斗",
  [2] = "离开后将不会计算本场战斗的积分,并有一段时间内不能再次参加此活动,确认退出吗?",
  [3] = "确认要离开吗?",
  [4] = "战斗开始了,全军出击!",
  [5] = "战斗已结束~",
  [6] = "我方的<font color=#00ff00>%1$s</font>成功击杀了对方的<font color=#ff0000>%2$s</font>",
  [7] = "敌军还有<font color=#ff0000>%d秒</font>到达战场,请做好战斗准备!",
  [8] = "%d.%s-资源:%d",
  [9] = "对方正在战斗中",
  [10] = "对方已经死亡",
  [11] = "首占据点",
  [12] = "当前据点处于保护时间内,暂时不能抢占",
  [13] = "有对方在抢占据点了,您不能抢夺",
  [14] = "占领中",
  [15] = "我方<font color=#00ff00>%s</font>开始占领据点<font color=#ff00ff>%s</font>",
  [16] = "敌方<font color=#ff0000>%s</font>开始占领据点<font color=#ff00ff>%s</font>",
  [17] = "我方<font color=#00ff00>%s</font>占领了据点<font color=#ff00ff>%s</font>",
  [18] = "敌方<font color=#ff0000>%s</font>占领了据点<font color=#ff00ff>%s</font>",
  [19] = "此据点已经被我方占领",
  [20] = "当前据点处于保护时间内,<font color=#ff00ff>%d秒</font>后可以抢占",
  [31] = "采集中",
  [32] = "获得资源",
  [33] = "大量资源出现在<font color=#ff00ff>%s</font>,快去抢夺!",
  [34] = "采集成功资源 + <font color=#00ff00>%d</font> ",
  [35] = "我方<font color=#00ff00>%s</font>采集了<font color=#ff00ff>%s</font>,我方获得<font color=#00ff00>%s</font>点资源",
  [101] = "个人资源量",
  [102] = "我方的<font color=#00ff00>%1$s</font>成功击败了对方的<font color=#ff0000>%2$s</font>，我方资源产量增加",
  [111] = "%1$s的%2$s成功获得<font color=#ffff00>%3$s</font>",
  [121] = "你处于保护状态,不能执行此操作",
  ["EndReason"] = {
    [1] = "时间到,战斗结束",
    [2] = "双方资源点数差距大于%d分,比赛提前结束",
    [3] = "比赛双方人数过于悬殊,比赛提前结束"
  },
  ["GrapFail"] = {
    [1] = "占领中断",
    [2] = "占领中断",
    [3] = "占领中断"
  },
  ["GatherFail"] = {
    [1] = "采集中断",
    [2] = "采集中断",
    [3] = "采集中断",
    [4] = "采集物不存在",
    [5] = "其他人正在采集此资源"
  },
  ["Error"] = {
    [1] = "对方正在战斗中"
  }
}
