textRes.GangRace = {
  ["ErrorCode"] = {
    [1] = "非本帮成员无法参加!",
    [2] = "当前不在支持阶段,无法执行该操作!",
    [3] = "请选择正确的参赛选手!",
    [4] = "你的等级不足,无法执行该操作",
    [5] = "你的支持的金额错误,无法执行该操作",
    [6] = "你的金币不足,无法执行该操作",
    [7] = "你已经支持过队员,不能再次支持!",
    [8] = "不满足参加该活动的条件!"
  },
  [1] = "您已下注成功！",
  [2] = "请选择参赛选手!",
  [3] = "请选择投注金额!",
  [4] = "当前无法投注!",
  [5] = "本次比赛已结束，请下次准时参加!",
  [6] = "您在帮派赛跑中支持了选手，恭喜您获得奖励!",
  [7] = "帮派赛跑比赛已经开始竞猜，请前往帮派赛跑使者处参加。",
  [8] = "新的比赛已经开始，请进行新一轮竞猜。",
  [9] = "您已经投注!",
  [10] = "点击参加",
  [11] = "您当前无法传送",
  [12] = "战斗中暂时无法参加",
  [13] = "00分00秒",
  [14] = "%02d分%02d秒"
}
