textRes.Group = {
  ["OperationName"] = {
    [1] = "群组信息",
    [2] = "邀请好友",
    [3] = "解散群组",
    [4] = "退出群组"
  },
  ["GetSingleGroupInfoError"] = {
    [1] = "群组不存在",
    [2] = "您已不在该群组中"
  },
  ["CreatGroupError"] = {
    [1] = "您的等级不足",
    [2] = "创建群组数量已达上限",
    [3] = "群组名称非法"
  },
  ["GroupRenameError"] = {
    [1] = "群组不存在",
    [2] = "您不是群主，无法改名",
    [3] = "群组名称非法"
  },
  ["ChangeAnnouceMentError"] = {
    [1] = "群组不存在",
    [2] = "您不是群主，无法修改群公告",
    [3] = "群组名称非法"
  },
  ["QuitGroupError"] = {
    [1] = "群组不存在",
    [2] = "您已经不在该群组",
    [3] = "群主不能退出"
  },
  ["KickMemberError"] = {
    [1] = "群组不存在",
    [2] = "您不能剔除成员",
    [3] = "该成员已不在群组中",
    [4] = "群主不能踢除"
  },
  ["DissolveGroupError"] = {
    [1] = "群组不存在",
    [2] = "只有群主可以解散群组"
  },
  ["InviteMemberError"] = {
    [1] = "群组不存在",
    [2] = "您已经不在该群组",
    [3] = "群组成员已满",
    [4] = "对方等级不足",
    [5] = "对方已经在群组中了",
    [6] = "对方加入的群组数量已达上限",
    [7] = "您和对方不是好友关系，不能邀请"
  },
  [1] = "您已经不在该群里了",
  [2] = "请输入群组名称",
  [3] = "您输入的内容太长啦",
  [4] = "您输入的内容包含敏感词汇",
  [5] = "您创建的群组已达上限%d个，请解散群组后再创建新群组",
  [6] = "%d级以上才可以创建群组",
  [7] = "请输入群组公告",
  [8] = "请输入新的群名",
  [9] = "请输入新的群公告",
  [10] = "您已经被踢出当前群组了",
  [11] = "您可以邀请等级[00aa00]%d级以上[-]的[00aa00]在线好友[-]加入群组",
  [12] = "当前群组已达到成员数量上限%d人",
  [13] = "已选择%d人",
  [14] = "请选择要邀请的好友",
  [15] = "您邀请的好友过多，将会超过群组人数上限啦",
  [16] = "群组名称修改成功",
  [17] = "群组公告修改成功",
  [18] = "群组：<font color=#00ff00>%s</font>  创建成功",
  [19] = "您退出了 <font color=#00ff00>%s</font>  群组",
  [20] = "您被请离了 <font color=#00ff00>%s</font>  群组",
  [21] = "群组 <font color=#00aa00>%s</font>  解散啦",
  [22] = "您被<font color=#00ff00>%s</font>邀请加入了 <font color=#00ff00>%s</font>群组",
  [23] = "<font color=#00ff00>%s</font> 邀请 <font color=#00ff00>%s</font>加入了群组",
  [24] = "<font color=#000086>%s</font>退出了群组",
  [25] = "确定要退出[00ff00]%s[-]群组吗？",
  [26] = "确定要解散[00ff00]%s[-]群组吗？",
  [27] = "确定要请离[00ff00]%s[-]吗？",
  [28] = "%d人",
  [29] = "群组人数已达上限啦",
  [30] = "群组功能暂未开放",
  [31] = "您邀请 <font color=#00ff00>%s</font> 加入了群组",
  [32] = "请离成功",
  [33] = "群组聊天已清空",
  [34] = "少侠还没有加入群组",
  [35] = "最多选择%d个群组",
  [36] = "选择分享的群组",
  [37] = "请选择需要分享的群组"
}
