textRes.JueZhanJiuXiao = {
  [1] = "距离九重天开启还剩%s",
  [2] = "%02d分%02d秒",
  [3] = "%02d秒",
  [4] = "寻找：%s",
  [5] = "您已领取过该奖励，请勿重复领取",
  [6] = "轮空",
  [7] = "您的队伍即将穿越云霄，进入异域空间",
  [8] = "寻找下列NPC，将会有意想不到的收获！",
  [9] = "只有队长可进行此操作！",
  [10] = "活动尚未开启",
  [11] = "必须先找到所有NPC",
  [12] = "决战九霄",
  [13] = "决战九霄活动开始了，小伙伴们赶紧来参加吧！",
  [14] = "参加",
  [15] = "稍后",
  ["SEnterJiuXiaoMapRes"] = {
    [1] = "距离九重天开启还剩%1$s，请耐心等待",
    [2] = "队伍人数不足 (至少需要%1$s人组队)",
    [3] = "活动已经关闭了"
  },
  ["SJiuXiaoNormalResult"] = {
    [1] = "不再活动时间内",
    [2] = "该奖励已被选取，请选择其他奖励",
    [3] = "您已领取过该奖励，请勿重复领取",
    [4] = "您的队伍即将穿越云霄，进入异域空间",
    [5] = "恭喜完成全部挑战，即将传送回人间！"
  }
}
