textRes.LoveTree = {
  [0] = "连理木",
  [1] = "%d级解锁",
  [2] = "娘子%s和我的连理木",
  [3] = "我和夫君%s的连理木",
  [4] = "我的连理木",
  [5] = "%s和%s的连理木",
  [6] = "成长值+%d",
  [7] = "你与%s的爱情感动了上天,月老赐予你们一棵连理木,现在就回家看看吧!",
  [8] = "连理木喝饱了,成长值+%d",
  [9] = "连理木吃饱了,成长值+%d",
  [10] = "正在等待对方同意",
  [11] = "对方拒绝了你的邀请",
  [12] = "对方邀请您一起玩%s",
  [13] = "给你的连理木起一个好听的新名字吧!",
  [14] = "树名不能为空",
  [15] = "树名最多%d个汉字或%d个字符",
  [16] = "树名中包含非法字符",
  [17] = "树名中包含敏感字符",
  [18] = "树名不可用",
  [19] = "爱情宣言",
  [20] = "请输入爱情宣言",
  [21] = "爱情宣言最多%d个汉字或%d个字符",
  [22] = "爱情宣言包含敏感字符",
  [23] = "您今天已经浇过水了哦~",
  [24] = "您今天已经施过肥了哦~",
  [25] = "您今天已经和连理木玩耍过了,继续玩耍不会获得更多成长值,是否继续?",
  [26] = "连理木的成长助力未满,不能触发暴击效果,是否继续?",
  [27] = "和连理木玩耍需要同自己的伴侣组成2人队伍,由队长发起玩耍哦~",
  [28] = "您今天已经对这颗树许过愿了",
  [29] = "今日的成长助力已满,不需要许愿了",
  [30] = "小果实还未成熟哦~",
  [31] = "大果实还未成熟哦~",
  [32] = "您已经采摘过这批果实了",
  [33] = "这颗树上已经没有情谊果了",
  [34] = "在天愿作比翼鸟，在地愿为连理枝，对我的连理树许个愿吧{lovetree:许愿,%s}",
  [35] = "我的连理木结果了,快来采摘吧{lovetree:采摘,%s}",
  [36] = "您并没有帮派可以求助(T_T)",
  [37] = "%d级(成长值:%d)",
  [38] = "拼图已完成",
  [39] = "拼图成功!",
  [40] = "拼图超时~",
  [41] = "有玩家放弃了拼图",
  [42] = "剩余:%ds",
  [43] = "有玩家放弃了指吻",
  [44] = "没有在结束前都按下指纹,游戏失败",
  [45] = "成功许下心愿",
  [46] = "心有灵犀一点通!",
  [47] = "功能暂未开启",
  [48] = "少侠莫急,%ds秒后就能再次发起求助哦~",
  ["PlayType"] = {
    [1] = "指吻",
    [2] = "你画我猜",
    [3] = "双人拼图"
  },
  ["Record"] = {
    [1] = "%s:\n        [ff60af]%s[-]给连理木浇了一桶水,成长值+%d",
    [2] = "%s:\n        [ff60af]%s[-]给连理木施了一袋肥,成长值+%d",
    [3] = "%s:\n        主人%s和连理木一起玩耍,成长值+%d",
    [4] = "%s:\n        [ff60af]%s[-]对连理木许下心愿,成长助力+%d"
  },
  ["SGetCoupleTreeInfoFail"] = {},
  ["SSetCoupleTreeNameFail"] = {
    [2] = "长度超出限制",
    [3] = "网络出错,请稍后重试",
    [4] = "名称中包含敏感词"
  },
  ["SSetCoupleTreeDescriptionFail"] = {
    [2] = "长度超出限制",
    [3] = "网络出错,请稍后重试",
    [4] = "名称中包含敏感词"
  },
  ["SCareCoupleTreeFail"] = {
    [2] = "有果实未摘取",
    [3] = "已经浇过水了",
    [4] = "已经施过肥了",
    [5] = "货币不足,不能浇水了",
    [6] = "货币不足,不能施肥了"
  },
  ["SWishToCoupleTreeFail"] = {
    [1] = "连理木无效",
    [2] = "不能对自己的连理木许愿",
    [3] = "连理木的成长助力已满",
    [4] = "今天已经对此连理木许愿过了",
    [5] = "达到许愿次数上限了"
  },
  ["SChangeCoupleTreeAppearanceFail"] = {
    [2] = "外观未解锁"
  },
  ["SCollectCoupleTreeFruitFail"] = {
    [2] = "果实未成熟",
    [3] = "已经采摘过了"
  },
  ["SGuestCollectCoupleTreeFruitFail"] = {
    [1] = "连理木无效",
    [2] = "不能采摘自己的情谊果",
    [3] = "已经采摘过情谊果了",
    [4] = "已经没有了",
    [5] = "达到采摘上限了"
  },
  ["SGetCoupleTreeCareRecordFail"] = {
    [1] = "连理木无效"
  },
  ["SSendCoupleTreePlayInvitationFail"] = {
    [1] = "不能重复邀请",
    [2] = "对方已经发起邀请了",
    [3] = "必须和自己的配偶组成2人队伍才能开始玩耍",
    [4] = "必须和自己的配偶组成2人队伍才能开始玩耍"
  },
  ["SFinishDualJigsawFail"] = {
    [1] = "拼图游戏已经超时"
  },
  ["SSendFingerPrintInfoFail"] = {
    [2] = "只能按一次指吻哦~"
  }
}
