textRes.Mall = {
  ["WeekDay"] = {
    [0] = "每天",
    [1] = "周日",
    [2] = "周一",
    [3] = "周二",
    [4] = "周三",
    [5] = "周四",
    [6] = "周五",
    [7] = "周六"
  },
  ["ErrorInfo"] = {
    [1] = "元宝不足",
    [2] = "师门积分不足",
    [3] = "购买的物品不存在",
    [4] = "卖光啦~下次再来吧！"
  },
  ["CreditsType"] = {
    [1] = "侠义值",
    [2] = "竞技场积分",
    [3] = "师门贡献",
    [4] = "声望值",
    [5] = "天梯积分"
  },
  ["CreditsTypStr"] = {
    [0] = "请在左侧选择需要兑换的道具",
    [1] = "帮助低等级玩家抓鬼，主线，副本可获得侠义值",
    [2] = "参加竞技场，首席争霸，天下会武可获得",
    [3] = "",
    [4] = "参加科举乡试和会试可获得"
  },
  ["MesteryStore"] = {
    [1] = "神秘商店",
    [2] = "敬请期待",
    [3] = "您已刷新的够多了，明天再来吧O(∩_∩)O",
    [4] = "今日剩余刷新次数%d，本次刷新需要花费%d%s，是否继续？",
    [5] = "%s不足，是否去充值？",
    [6] = "免费",
    [7] = "%.1f折",
    [8] = "限购%d/%d",
    [9] = "商品内容已发生变化",
    [10] = "所选商品库存不足o(╯□╰)o",
    [11] = "免费刷新",
    [12] = "%d%s刷新",
    [13] = "今日剩余刷新次数%d，本次刷新免费！",
    [14] = "刷新",
    [15] = "本次刷新为商品售罄免费刷新，不会消耗今日刷新次数，是否确定刷新？",
    [16] = "四个摊位商品售罄，获得一次免费刷新机会！",
    [17] = "今日商品售罄免费刷新次数已达上限"
  },
  [1] = "%s%d点%d分刷新",
  [2] = "购买了%sx%d",
  [3] = "兑换了%sx%d",
  [4] = "没有足够的%s",
  [5] = "请选择要购买的物品",
  [6] = "$ %.02f",
  [7] = "积分兑换",
  [8] = "积分",
  [100] = "本周剩余可购买数：",
  [101] = "本日剩余可购买数:"
}
