textRes.PirateShip = {
  [1] = "已开始",
  [2] = "剩余次数:[00ff00]%d/%d[-]",
  [3] = "我方",
  [4] = "敌方",
  [5] = "海盗船活动开始，赶紧前往参加吧。<a href='pirateship' id='btn_pirateship'><font color=#00ff00><u>前往参加</u></font></a>",
  [6] = "我服<font color=#00ff00>%s</font>帮派在海盗船活动中战胜了<font color=#ff0000>%s服%s帮派</font>，为本服挣得荣誉",
  [7] = "我服<font color=#00ff00>%s</font>帮派在海盗船活动中惜败于<font color=#ff0000>%s服%s帮派</font>，望再接再厉",
  [8] = "经过大家的英勇奋战，我帮成功战胜<font color=#ff0000>%s服%s帮派</font>，获得此次海盗船的胜利，可喜可贺",
  [9] = "尽管大家英勇奋战，我帮惜败于<font color=#ff0000>%s服%s帮派</font>，下次海盗船活动继续努力",
  [10] = "海盗船战斗已经结束，当前处于活动结算中~",
  [11] = "挑战的次数用完了~",
  [12] = "您没有参与防守",
  [13] = "您没有第%d小队",
  [14] = "%d分钟前",
  [15] = "结算中",
  [16] = "该难度已被成功挑战，再次挑战不会增加我方积分，是否挑战？",
  [17] = "海盗船",
  [18] = "队伍中无法进行宠物战斗",
  [19] = "海盗船活动尚未开始",
  [20] = "请切换到敌方舰队进行攻击哦~",
  [21] = "您当前没有选择宠物小队",
  [22] = "每页显示%d个玩家",
  ["DifficultName"] = {
    [1] = "普通",
    [2] = "困难",
    [3] = "噩梦"
  },
  ["SGetVersusListFailed"] = {
    [-1] = "活动未开始"
  },
  ["SGetPirateInfoFailed"] = {
    [-1] = "活动未开始",
    [-2] = "服务器忙,请稍后重试",
    [-3] = "网络错误,请稍后重试"
  },
  ["SGetDefendRecordFailed"] = {
    [-1] = "活动未开始",
    [-2] = "网络错误,请重试"
  },
  ["SViewDefendRecordFailed"] = {
    [-1] = "网络错误,请重试"
  },
  ["SGetAttackRecordFailed"] = {
    [-1] = "活动未开始",
    [-2] = "您还没有发起过进攻~"
  },
  ["SGetPetTeamInfoFailed"] = {
    [-1] = "活动未开始",
    [-2] = "服务器忙,请稍后重试",
    [-3] = "网络错误,请稍后重试",
    [-4] = "对方没有防守小队"
  },
  ["SStartFightFailed"] = {
    [-1] = "活动未开始",
    [-2] = "可攻击次数不足",
    [-3] = "防守小队不存在",
    [-4] = "防守小队不匹配",
    [-5] = "战斗阶段结束",
    [-6] = "攻击小队不存在",
    [-7] = "有其他帮派成员正在攻击此玩家",
    [-8] = "开启战斗失败",
    [-9] = "当前挑战的难度已经被其他帮派成员战胜,请更换其他难度挑战",
    [-10] = "队伍中不能参与挑战"
  },
  ["SPiratePetFightEndFailed"] = {
    [-1] = "已经发过奖励了"
  }
}
