textRes.QixiSale = {
  [1] = "对方已经不是你的好友了",
  [2] = "是否向[00ff00]%1$s[-]发送[ffff00]%2$s[-]活动的绑定请求？",
  [3] = "[00ff00]%1$s[-]向您发送了[ffff00]%2$s[-]活动的绑定请求，是否同意？",
  [4] = "<font color=#00ff00>%1$s</font>拒绝了您的绑定请求，请您选择其他好友",
  [5] = "再给人家一点考虑的时间~%dS",
  [6] = "绑定成功",
  [7] = "是否和[00ff00]%1$s[-]解除[ffff00]%2$s[-]活动的绑定？",
  [8] = "<font color=#00ff00>%1$s</font>已经和您解除<font color=#ffff00>%2$s</font>活动的绑定",
  [9] = "绑定异性好友",
  [10] = "绑定",
  [11] = "成功发送绑定请求，请等待对方回应",
  [12] = "奖励领取成功",
  [13] = "获得%1$s×<font color=#ffff00>%2$s</font>",
  [14] = "购买成功",
  [15] = "赠送成功",
  [16] = "抽取（%d次）",
  [17] = "完成任务可以获得抽取机会",
  [18] = "今日抽取机会已用完",
  [19] = "您还没有折扣券是否抽取",
  [20] = "是否花费[ffff00]%1$s[-]%2$s购买%3$s？",
  [21] = "折扣价[ffff00]%d[-]/原价[s][ff0000] %d [-][/s]",
  [22] = "没有可以使用的折扣券",
  [23] = "请选择一个可以使用的折扣券",
  [24] = "您的操作太频繁了，请稍后再试",
  [25] = "选中好友已经不能接收该物品了",
  [26] = "已达对选中好友赠送次数限制",
  [27] = "已达该物品总赠送次数限制",
  [28] = "还未满足当前奖励领取条件",
  [29] = "没有在线且满足活动参与条件的异性好友",
  [30] = "(%d/%d)",
  [31] = "任务进度更新",
  [32] = "抽取次数已用完",
  [33] = "是否花费[ffff00]%1$s[-]%2$s购买%3$s赠送给[ff0000]%4$s[-]？",
  [34] = "购买确认",
  [35] = "赠送确认",
  [36] = "只能赠送亲密度不低于[ff0000]%d[-]的[ff0000]异性[-]好友",
  ["SSendBindFriendFail"] = {
    ["UNKNOW"] = "绑定好友请求发送失败（%d）",
    [1] = "对方不是您的异性好友",
    [2] = "您已经绑定过好友了",
    [3] = "对方已有绑定好友",
    [4] = "再给人家一点考虑的时间~%dS",
    [5] = "已发出请求, 等待对方确认中",
    [6] = "对方已离线",
    [7] = "您还有未处理的其他好友的绑定请求",
    [8] = "对方正在处理其他好友的绑定请求",
    [9] = "对方无法参加本活动",
    [10] = "对方暂时无法回复绑定请求",
    [11] = "对方已发出绑定请求, 无法回应本次绑定请求"
  },
  ["SAcceptBindFriendFail"] = {
    ["UNKNOW"] = "同意绑定失败（%d）",
    [1] = "绑定请求已失效"
  },
  ["SUnbindFriendFail"] = {
    ["UNKNOW"] = "解除绑定失败（%d）",
    [1] = "没有绑定的好友"
  },
  ["SFetchBoundFriendTaskAwardFail"] = {
    ["UNKNOW"] = "奖励领取失败（%d）",
    [1] = "奖励已经领取",
    [2] = "任务未完成，无法领取奖励"
  },
  ["SFetchBoundFriendTaskProgressAwardFail"] = {
    ["UNKNOW"] = "进度奖励领取失败（%d）",
    [1] = "奖励已经领取",
    [2] = "进度未达到，无法领取奖励"
  },
  ["SFetchCouponFail"] = {
    ["UNKNOW"] = "折扣券抽取失败（%d）",
    [1] = "可抽取次数不足"
  },
  ["SBuyCommodityFail"] = {
    ["UNKNOW"] = "购买限购物品失败（%d）",
    [1] = "购买失败，货币数量不足",
    [2] = "购买失败，折扣券数量不足",
    [3] = "购买失败，已达购买次数限制",
    [4] = "包裹已满，请先清理包裹",
    [5] = "您已经拥有该物品",
    [6] = "选择的折扣券不能应用到该物品"
  },
  ["SGiftCommodityFail"] = {
    ["UNKNOW"] = "赠送限购物品失败（%d）",
    [1] = "赠送失败，货币数量不足",
    [2] = "赠送失败，折扣券数量不足",
    [3] = "赠送失败，已达今日总赠送次数限制",
    [4] = "赠送失败，已达对该角色赠送次数限制",
    [5] = "赠送失败，您与对方亲密度未达到到赠送要求，或对方不是您的异性好友",
    [6] = "只有拥有该物品才能赠送他人",
    [7] = "赠送失败，对方已经拥有该物品",
    [8] = "赠送失败，对方已被赠送该物品",
    [9] = "赠送失败，选择的折扣券不能使用到该物品"
  },
  ["SFetchFeedbackAwardFail"] = {
    ["UNKNOW"] = "领取回馈失败（%d）",
    [1] = "货币消耗数量不足，无法领取",
    [2] = "回馈已领取",
    [3] = "包裹已满，请先清理包裹"
  }
}
