textRes.ReturnSale = {
  [1] = "是否花费折扣价[ffff00]%d[-]%s/原价[s][ff0000] %d [-][/s]%s购买%s?",
  [2] = "是否花费[ff0000]原价[-][ffff00]%d[-]%s购买%s?",
  [3] = "购买确认",
  [4] = "您还没有此类优惠券",
  [5] = "该商品不能使用此类折扣券哦",
  [6] = "当前没有分配新的天命点数",
  [7] = "分配成功",
  [8] = "使用",
  ["SBuyGeneralCommodityFail"] = {
    [1] = "相应货币不足",
    [2] = "折扣券数量不足",
    [3] = "已达此商品购买次数限制",
    [4] = "您的包裹已满，请及时清理",
    [5] = "已经拥有商品中的某些道具",
    [6] = "该商品不能使用对应的折扣券"
  },
  ["SFetchGeneralFeedbackAwardFail"] = {
    [1] = "货币消耗数量不足",
    [2] = "您已领取此回馈",
    [3] = "您的包裹已满，请及时清理"
  }
}
