textRes.TokenMall = {
  [1] = "兑换功能暂未开启，请耐心等待",
  [2] = "该活动兑换商城不存在",
  [3] = "该活动兑换商城暂未开启，请耐心等待",
  [4] = "%04d年%02d月%02d日~%04d年%02d月%02d日",
  [5] = "不限",
  [6] = "%d/%d",
  [7] = "积分不足，无法兑换",
  [8] = "积分兑换",
  [9] = "使用[00ff00]%d%s[-]兑换[00ff00]%sx%d[-]，是否确认？",
  [10] = "兑换次数达到上限",
  [11] = "不能手动刷新",
  [12] = "手动刷新次数已经达到上限",
  [13] = "距离下次刷新时间：%s",
  [14] = "%s刷新",
  [15] = "今日剩余刷新次数%d，",
  [16] = "本次刷新免费，是否继续？",
  [17] = "本次刷新需要花费%d%s，是否继续？",
  [18] = "刷新提示",
  [19] = "<font size=21 color=#4f3018>%s</font>",
  [20] = "免费",
  [21] = "兑换个数不能小于1",
  ["SMallInfoError"] = {
    [-1] = "商城未知错误(%d)",
    [1] = "商城已关闭"
  },
  ["SPointExchangeError"] = {
    [-1] = "兑换未知错误(%d)",
    [1] = "积分不足",
    [2] = "兑换次数达到上限",
    [3] = "商品已经下架",
    [4] = "活动已关闭",
    [5] = "商城已关闭"
  },
  ["SManualRefreshError"] = {
    [-1] = "手动刷新未知错误(%d)",
    [1] = "所需消耗不足",
    [2] = "刷新次数达到上限",
    [3] = "当前不需要刷新",
    [4] = "活动已关闭",
    [5] = "不支持手动刷新",
    [6] = "刷新次数错误",
    [7] = "商城已关闭"
  }
}
